[	
  {"title":"No more sprints, more projects","entry":"Officially passed middle way and now a senior in hack reactor. We now do no more pairing sprints but work in a team to build our own project. The team was randomized and I really like the team I got. We all were dedicated and diligent on getting what to be finished. We all had great role, and each of us fit that role great. We also holded each other accountable on getting some part of code done so that we can hook it up and test out the functionality. Just thinking about starting out a project from scratch always makes me feel nervous, but once I started writing some basic code, I just could not stop. Before this group project, we had an individual project we had to make within two days. I honestly didn't know what I could make, but I ended up making a simple alarm clock that makes you solve some math problems before the alarm turns off. I thought an alarm clock like that can help me, since I have trouble waking up and pretty much a snooze master. I was very impressed by other student's project as well. Many different ideas and different way of building the project, and each and everyone of the project was inspiring. To think that we come along so far in learning and now being able to build something out of nothing. The group project also made me feel similar way. I've never realized until I got to start working as a group, but how powerful it is to work with a team willing to build and work together to get the project done. At times, I didn't want to stop adding more features and functionality because it became a fun game to make."},
  {"title":"The real struggle starts","entry":"I'm in start of my 5th week as a HR student and I must admit, week four has been real tough on me. It almost made me feel if I'm even smart enough to do this. We finally got a taste of node.js and database. We had to create a chatterbox app, which we created only using jquery and using a third party database, but this time, we actually had to first create the chatterbox over using our node server and one more time using mySQL database. These projects were not the only thing that I was struggling, I am also starting to struggle with Toy Problems - it's an algorithmic problems we do everyday, and these have also been starting to get real hard. During week 3, we used backbone to create a music library and also first introduction to coffee-script. The mix of coffee-script with backbone was not fun at all. I wanted to share one of toy problem I was working where it took over a day to figure it out. I guess I just did not understand recursion very well, but after the this toy problem, I felt like I had a better understanding.", "image" : "./img/isIsland.png"},
	{"title":"Week 2","entry":"I've just finished my second week. I have to tell you, the time just FLYS by. You're so into working, building, learning a new concept in code, you just lose track of time. These past two weeks, I must say, it felt like it's been only a day since I started- exaggerating. Week two was definitely more challenging for me. Although week one was not easy, one of the assignment in week two was just killing me. Me and my pair just could not figure out what was wrong with our code to get it to work. We've spent hours trying to figure out where we went wrong, but we had no luck. After just literally blankly staring at our code, we decided to use the most important tool, debugger. I've honestly never used debugging tool, but after the experience me and my partner had, I think I'll start using it more and more. While trying to debug what was wrong with our code - this still took us a very long time to figure out, we've found that our mistake was not something as big deal. We've realized that we were only testing only one diagonal instead of looping through to check every instance of diagonal. It was definitely after hours from school, but we kept our heads up high and decided to not give up and figure out what was wrong with our code. I think this was an amazing experience for me because we persisted and went through even when class was over. The dedication that my pair and I had to work through it gave me real good feeling. What I took away from week two is that, there will be difficult times where you just want to give up, but that I'm not alone. If we work as a team and put in our dedication and strive to finish the goal line, there will always be a way even if you have to sacrifice some of your sleeping or leisure time. Again, week two has been an amazing experience for me to work with new pairs and work together to finish the goal line."},
	{"title":"Week 1","entry":"Before starting my first week as HR student, I had to complete pre-course assignments to help us stay sharp and keep on track before our first week. Pre-course was not too bad at all. I don't want to get into too much details, but we had to re-create couple of underscore functions on our own. It was challenging but it was definitely fun. Start of week one. Very nervous, very excited, and very worried. I did not know how advanced I was with javascript and I did not know the expectation from school. First day was an amazing experience. We were introduced to all of HR staff members in remote and introduced to all the amazing students in the cohort. The main thing I was not used to while learning to code was pair programming. HR makes a big emphasis in working as a pair. Not just to speed up the assignemnt but in order for us to think and act like one. We all have different ideas to approach and tackle a problem, but the pair programming helped me realized many brilliant ideas other students have. What I took away from my experience in first pair programming was not the two great minds into one, but the relation. We both can be the smartest and have the best ideas but if we're not working well as a pair, it just wont work. I learned that it takes great amount of effort to work as a pair. Sometimes your ego and pride has to be thrown away because that is THE only way to work great as a pair. If pairing goes well, the ideas just flows through, the code seems much more understanding, and most importantly, the build of friendship just from pair coding. The willingness to help each other to understand and not leave someone behind is the biggest lesson I've learned in pair programming. Sometimes, you won't understand a concept, but your pair will have a great understanding of it. But also, you will have a great understanding of another concept but your partner doesn't, and I believe this is the beauty of pair programming. Give a hand, you will receieve a hand as well."},
	{"title":"The Road to Hack Reactor Acceptance","entry":"After couple weeks of studying javascript on my own, I found out that there are code boot camps out there, which helps you to become a full stack developer. The two boot camps that gave me most interest were Full Stack Academy and Hack Reactor. They both had advantages on their own. After researching more, I found out that Hack Reactor was actually one of the best code camp out there. This was where I wanted to go. If I'm starting something, I always like to strive for best. My goal was to get into Hack Reactor, but I did apply to Full Stack Academy as well, because I wanted to see how far I've learned. Statistically, HR was harder school to get into, so I wanted to use Full Stack Academy as my guide how much more I need to learn. This doesn't mean FS Academy has lenient acceptance. I remember when I first got an interview from FS Academy, I knew I did not do well. It was totally on a different level from what I was studying. This lead me to realize that, HR must be even harder to get into. I definitely knew I wasn't ready to have an interview by HR, so I scheduled my interview month after my FS Academy interview. HR sent me many materials I need to cover and need to know in order to do well in the interview. I studied over and over the materials they advised me to know. Time flew by and it was time for my HR interview. First couple of questions were not bad. I knew most of materials in javascript. I think about into third question, I was LOST. I did not even know how to approach the question they asked. It was as if, they opened another world of javascript to me and expected me to be prepared to answer the question. Although my interview did not go well, the experience of interview was great. As I was stuck, my interviewer was helping me to solve the question by giving some hints and how to understand what I'm suppose to write. This was a great experience for me because now I knew some idea how to approach the question. After the interview, I studied over and over and tried to understand the problem they gave me. After the decision of the interview, they advised me that in order to reschedule an interview, I will have to self-study the material for a month and also build a project. Projects...I have never even built a simple html website to this point. The sound of making project gave me lost hopes. I did not know where to even start. I knew I did not want to give up, so I started researching online. Luckily, while doing freecodecamp, once you complete most of the code challenges, they give you an idea of project you can build. My first project I've decided to make was a weather determinator by your ip address. Javascript would track your ip address and determine your location, and from this I found a cool API to determine your current weather with your location. It was not the most complicated project, but I felt real good that I was able to make it. I was also able to add some cool feature to it by determining current weather by inputing a city name or the zip code. Time flew by again while building the project and self-studying. I sent my project into HR and they sent me an confirmation to schedule another interview. I thought I was ready this time. I scheduled the interview two days after I got a confirmation email. Second interview time. This time, I was ready. I was able to pass few questions from beginning, but again I hit another road block. I was lost again and did not know what I was suppose to do. It took some time, but my interviewer again guided me to finish the problem with help. Decision email came about two days later, and again I was not accepted. But this email gave me more hope. They advised that I was real close and I just need a little more time self-studying. Again, they advised that I would need to make another project to set up an interview. As soon as I got the email, it was time to work on it. I ended up creating a calculator as my project. It was not super high tech having log, trig functions, or any other advanced scientific calculator would have, but I did add couple features to the project. I added calculator to evaluate negative number, exponents, and clear last value. It was an amazing experience for me to build this project. While building this project, I realized that I grew in understanding javascript and that I am capable of becoming an engineer. This gave me a lot of hope and I continued to study. It was time for my third interview. I was nervous. I knew I grew in knowledge in javascript but I was still unsure if I knew enough to do well in the interview. Also, I have set my interview limit to three. If I could not get in my third time, I knew I had to let it go and move on. While interviewing, this time it was totally different. I actually knew what I was doing. I understood the question and knew how I can approach the problem. The interview was not perfect, but definitely it was better than the other two interviews I've had. After the interview, I checked out my code and realized I could have done better at certain parts. I was still not hundred percent sure I would get accepted. About two days later, HR sent me an email saying that I was accepted! This was start of my new journey."},
	{"title":"The Start","entry":"My journey begins in coding when I was unhappy with where I was going with my life. I knew that what I was doing wasn't what I wanted to make it as my career. This realization lead me to talking to some of my friends that was in tech industry and in web developing. They advised me to checkout codeacademy if I wanted to start learning about web developing. I started with basic html and css from codeacademy and then it lead me to javascript. Upon researching online, I learned that javascript language is growing and will continually grow. I learned that node.js is one of the hottest thing out there, and this was in the road with javascript. I definitely didn't know much about node.js but realizing it is growing, I knew javascript was the path I wanted to go. I started with javascript classes in codeacademy, but this was definitely not easy. There was just so much to learn, and many times studying alone, I was lost. This lead me to many frustrations and losing hope if I was even able to learn javascript. Perculliarly, this actually gave me more ambition to finish what I started. The challenge was actually a thrill for me. I always like to challenge myself to something new to grow, and learning javascript was my chance to grow. With my ambition, I started working on coderbyte challenges, challenges from freecodecamp, and any free resource online to help me learn javascript. This was not easy. Some challenges took me hours solve them. Most challenges were so difficult for me, I had to lean to google, to research how I can approach the problem and understand. What I took away from the frustration and failure was that if I can perservere and continue to work, I am one step closer to my goal."}
]

